<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"1b88d3923a5714ffb249e83a75327c596c86c00605e1b8ba6a1021f9fdca4f65","plan_job_ref":"Job Plan Airflow DAGs #178 at https://github.com/cal-itp/data-infra/actions/runs/16063047489","plan_out_hash":"668f14c610ad0660d0adcfaf2e0dac09ceac749d1ded4852ebe0bdb9f7a605a4","plan_hash":"e4bdf5436df2ea7154ff4d00223669671a125e5b089a31a867653969c6bffd1d","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "O6VdsQ==" -> (known after apply)
!~      detect_md5hash      = "c7P1BXjTanwkHuRdyRoP3w==" -> "different hash"
!~      generation          = 1751587167521559 -> (known after apply)
        id                  = "calitp-staging-composer-dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"
!~      md5hash             = "c7P1BXjTanwkHuRdyRoP3w==" -> (known after apply)
        name                = "dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/staging/transit_database/stg_transit_database__ntd_agency_info.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "k5eeXg==" -> (known after apply)
!~      detect_md5hash      = "pUTstkczZnIZlZDGn/Du/A==" -> "different hash"
!~      generation          = 1749663120524662 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/staging/transit_database/stg_transit_database__ntd_agency_info.sql"
!~      md5hash             = "pUTstkczZnIZlZDGn/Du/A==" -> (known after apply)
        name                = "data/warehouse/models/staging/transit_database/stg_transit_database__ntd_agency_info.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-partial_parse will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-partial_parse" {
        id                  = "calitp-staging-composer-data/warehouse/target/partial_parse.msgpack"
        name                = "data/warehouse/target/partial_parse.msgpack"
#        (21 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #178](https://github.com/cal-itp/data-infra/actions/runs/16063047489)